OFoamDjango/OFCases/bio_2D_template/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#include        "../setUp"

vertices
(
    ($lx0 $ly0 $lz0)    //0
    ($lx1 $ly0 $lz0)    //1
    ($lx1 $ly1 $lz0)    //2
    ($lx0 $ly1 $lz0)    //3
    ($lx0 $ly0 $lz1)    //4
    ($lx1 $ly0 $lz1)    //5
    ($lx1 $ly1 $lz1)    //6
    ($lx0 $ly1 $lz1)    //7
    
    ($lx0 $ly2 $lz0)
    ($lx1 $ly2 $lz0)
    ($lx1 $ly3 $lz0)
    ($lx0 $ly3 $lz0)
    
    ($lx0 $ly2 $lz1) //12
    ($lx1 $ly2 $lz1)
    ($lx1 $ly3 $lz1)
    ($lx0 $ly3 $lz1)

    ($lx0 $ly4 $lz0) //16
    ($lx1 $ly4 $lz0)
    ($lx0 $ly4 $lz1)
    ($lx1 $ly4 $lz1)
    
    ($lpx1 $ly2 $lz0)
    ($lpx1 $ly3 $lz0)
    ($lpx1 $ly2 $lz1)
    ($lpx1 $ly3 $lz1)
    
    ($lpx2 $ly0 $lz0)
    ($lpx2 $ly1 $lz0)
    ($lpx2 $ly0 $lz1)
    ($lpx2 $ly1 $lz1)

    

);

blocks
(
    hex (0 1 2 3 4 5 6 7) ($nx1 $ny1 1) simpleGrading (1 1 1)
    hex (3 2 9 8 7 6 13 12) ($nx1 $ny2 1) simpleGrading (1 1 1)
    hex (8 9 10 11 12 13 14 15 ) ($nx1 $ny1 1) simpleGrading (1 1 1)
    hex (11 10 17 16 15 14 19 18) ($nx1 $ny3 1) simpleGrading (1 $Gy 1)
    hex (20 8 11 21 22 12 15 23) ($nx2 $ny1 1) simpleGrading (1 1 1)
    hex (1 24 25 2 5 26 27 6) ($nx2 $ny1 1) simpleGrading (1 1 1)
);

edges
(
);

boundary

(


    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
            (3 8 9 2)
            (7 6 13 12)
            (8 11 10 9)
            (11 16 17 10)
            (12 13 14 15)
            (15 14 19 18)
            (20 21 11 8) //water_inlet
            (22 12 15 23) //water inlet back
            (1 2 25 24) //
            (5 26 27 6) //
        );
    }
    top
    {
        type patch;
        faces
        (
            (16 18 19 17)
        );
    }
    walls
    {
        type wall;
        faces
        (
            (0 4 7 3) //side_left_lowest
            (3 7 12 8) //side_left
            (9 13 6 2) //side_right (2 6 5 1)
            (1 5 4 0) // bottom
            (21 23 15 11) // water inelt_up
            (8 12 22 20) // water_inlet_down
            (24 26 5 1)
            (2 6 27 25) // water_out_upFace
            (10 14 13 9) //water_out_upper
        );
    }

    water_inlet
    {
        type patch;
        faces
        (
            (20 22 23 21)//(8 12 15 11)
        );
    }

    air_inlet
    {
        type patch;
        faces
        (
            (11 15 18 16)
        );
    }
    
    air_out
    {
        type patch;
        faces
        (
            (17 19 14 10)
        );
    }

/*
    water_out_up
    {
        type patch;
        faces
        (
            (10 14 13 9)
        );
    }
*/    
    water_out_down
    {
        type patch;
        faces
        (
            (25 27 26 24)//(2 6 5 1)
        );
    }
    
    
    
);

// ************************************************************************* //
