OFoamDjango/OFCases/bio_2D_template/0.org/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U; //(Single Field Fluid Velocity)
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#include        "../setUp"
dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0.0 0 0);

boundaryField
{
    frontAndBack
    {
        type            empty;
    }
    top
    {
         type           pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }
    walls
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    air_inlet
    {
        type           zeroGradient;
    }
    air_out
    {
        type           zeroGradient;
    /*
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           uniform (0 0 0);
    */
    } 

/*
  water_inlet // working in v7
    {
         type                flowRateInletVelocity;
         volumetricFlowRate  tableFile;
         volumetricFlowRateCoeffs
           {
            file            "$FOAM_CASE/inlet_flow_data_step";    // name of data file
            outOfBounds         clamp;       // optional out-of-bounds handling
            interpolationScheme linear;      // optional interpolation method
          }
    }
    
    water_inlet // working in v7
    {
     	type 		uniformFixedValue;
    	uniformValue 	 
	{
	  type             csvFile;  
          nHeaderLine      0;              // number of header lines  
          refColumn        0;                // time column index  
          componentColumns (1 2 3 );     // data column index  
          separator        ",";               // optional (defaults to ",")  
          mergeSeparators  no;        // merge multiple separators  
          file             "inlet_data.csv";
	}
    }
    
    water_inlet // working in v7
    {
     	type 		uniformFixedValue;
    	uniformValue 	table
    	(
        (0 (0.1 0 0))
        (0.005 (0.1 0 0))
        (0.01 (0.1 0 0))
        (0.015 (0.1 0 0))
        (0.02 (0.05 0 0))
    	);
    } 
 */    
     
 
/*
  water_inlet // version 8
  {
        type      uniformFixedValue;
        uniformValue   tableFile;
        uniformValueCoeffs
        {
            format              csv;
            nHeaderLine         0;          // number of header lines
            refColumn           0;          // reference column index
            componentColumns    (1 2 3);    // component column indices
            separator           ",";        // optional (defaults to ",")
            mergeSeparators     no;         // merge multiple separators
            file                "data/velocity.csv";  // name of csv data file
            outOfBounds         clamp;      // optional out-of-bounds handling
            interpolationScheme linear;     // optional interpolation scheme
        }
    }
*/   
    water_inlet
    {
        type            flowRateInletVelocity;//fixedValue;
        volumetricFlowRate  $flowRate;
        value           uniform $flowVelocityInitial;
    }
  
    water_out_up
    {
        type           zeroGradient;
    }
    water_out_down
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           uniform (0 0 0);
    }
    oldInternalFaces
    {
        type            fixedValue;
	value           uniform (0 0 0);
    }
}


// ************************************************************************* //
