OFoamDjango/OFCases/bio_2D_template/0.org/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
   frontAndBack
    {
        type            empty;
    }
    top
    {
        type            totalPressure;
        p0              uniform 0;
    }
    walls
    {
        type          fixedFluxPressure;
    }
    air_inlet
    {
       type          zeroGradient;
    }
    air_out
    {
        type          zeroGradient;
    }    
    water_inlet
    {
      type          zeroGradient;
    }
    water_out_up
    {
       type           zeroGradient;
    }
    water_out_down
    {
        type            fixedValue;//totalPressure;
        p0              uniform 0;
        value		 uniform 0;
    }
    oldInternalFaces
    {
        type           zeroGradient;
    }
}


// ************************************************************************* //
