OFoamDjango/OFCases/bio_2D_template/0.org/K
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      K;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 0 0 0 0 0];

internalField   uniform 1e-9;

boundaryField
{
  frontAndBack
    {
        type            empty;
    }
    top
    {
        type           zeroGradient;
    }
    walls
    {
        type           zeroGradient;
    }
    air_inlet
    {
        type           zeroGradient;
    }
    air_out
    {
        type           zeroGradient;
    }    
    water_inlet
    {
        type           zeroGradient;
    }
    water_out_up
    {
        type           zeroGradient;
    }
    water_out_down
    {
        type           zeroGradient;
    }
    oldInternalFaces
    {
        type           zeroGradient;
    }
}


// ************************************************************************* //
