OFoamDjango/OFCases/bio_2D_template/0.org/Uwetting
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      Uwetting;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    frontAndBack
    {
        type            empty;
    }
    top
    {
        type            zeroGradient;
    }
    walls
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    air_inlet
    {
        type            zeroGradient;
    }
    air_out
    {
 	type            zeroGradient;
    }    
    water_inlet
    {
 	type            zeroGradient;
    }
    water_out_up
    {
 	type            zeroGradient;
    }
    water_out_down
    {
 	type            zeroGradient;
        /*
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           uniform (0 0 0);
        */
    }
    oldInternalFaces
    {
        type            fixedValue;
	value           uniform (0 0 0);
    }
}


// ************************************************************************* //
