OFoamDjango/OFCases/bio_2D_template/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#include        "../setUp"
defaultFieldValues
(
    volScalarFieldValue eps 0.999
    volScalarFieldValue alpha.wetting 0
 //   volScalarFieldValue K 0
);

regions
(
    boxToCell
    {
        box (0 0 -1) (10 0.33 1);

        fieldValues
        (
            volScalarFieldValue alpha.wetting $water_ini_level
            volScalarFieldValue eps $posity_Top_level
        //    volScalarFieldValue K 1e-12;
        );
    }
    
        boxToCell
    	{
        box (0 0.33 -1) (10 0.38 1);

        	fieldValues
        	(
            	volScalarFieldValue alpha.wetting $water_ini_level
            	volScalarFieldValue eps $posity_Mid_level
          //   volScalarFieldValue K 1e-15;
        	);
    	}
    
            boxToCell
    {
        box (0 0.38 -1) (10 0.53 1);

        fieldValues
        (
            volScalarFieldValue alpha.wetting $water_ini_level
            volScalarFieldValue eps $posity_Bot_level
           //  volScalarFieldValue K 1e-12;
        );
    }
);


// ************************************************************************* //
